In [1]:
# pip install sqlalchemy

In [2]:
# pip install psycopg2-binary

In [4]:
import sqlalchemy

In [5]:
%load_ext sql
from sqlalchemy import create_engine

In [5]:
# create_engine = sqlalchemy.create_engine('postgresql://postgres:polpol@localhost:5432/food_ordering_system')
# connection = create_engine.connect()

In [ ]:
# import pandas as pd

# df = pd.read_csv (r'/Users/damacm182_/Downloads/carinsuranceclaim.csv')   
# df.to_sql('carinsuranceclaim', create_engine, if_exists='replace', index = False, chunksize=381109)#

In [6]:
%sql postgresql://postgres:polpol@localhost:5432/food_ordering_system

In [7]:
%%sql
SELECT * FROM carinsuranceclaim limit 5

 * postgresql://postgres:***@localhost:5432/food_ordering_system
5 rows affected.

[(1, 'Male', 44, 1, 28, None, 0, '> 2 Years', 'Yes', 40454.0, 26.0, 217, 1),
 (2, 'Male', 76, 1, 3, None, 0, '1-2 Year', 'No', 33536.0, 26.0, 183, 0),
 (3, 'Male', 47, 1, 28, None, 0, '> 2 Years', 'Yes', 38294.0, 26.0, 27, 1),
 (4, 'Male', 21, 1, 11, None, 1, '< 1 Year', 'No', 28619.0, 152.0, 203, 0),
 (5, 'Female', 29, 1, 41, None, 1, '< 1 Year', 'No', 27496.0, 152.0, 39, 0)]

In [29]:

%%sql
SELECT "Gender", COUNT(*) AS count
FROM carinsuranceclaim
GROUP BY "Gender";

 * postgresql://postgres:***@localhost:5432/food_ordering_system
2 rows affected.

[('Female', 175020), ('Male', 206089)]

In [32]:
%%sql
SELECT "Region_Code", COUNT(*) AS count
FROM carinsuranceclaim
GROUP BY "Region_Code"
ORDER BY count
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/food_ordering_system
5 rows affected.

[(51, 183), (52, 267), (42, 591), (44, 808), (1, 1008)]

In [37]:

%%sql
SELECT COUNT(CASE WHEN 'Driving_License' = '1' THEN 1 END) AS individuals_with_license,
    COUNT(*) AS total_individuals,
        (COUNT(CASE WHEN 'Driving_License' = '1' THEN 1 END) * 100.0 / COUNT(*)) AS proportion_with_license
FROM carinsuranceclaim;----------------

 * postgresql://postgres:***@localhost:5432/food_ordering_system
1 rows affected.

[(0, 381109, Decimal('0E-24'))]

In [39]:
%%sql
SELECT CORR("Age", "Annual_Premium") AS correlation_coefficient
FROM carinsuranceclaim

 * postgresql://postgres:***@localhost:5432/food_ordering_system
1 rows affected.

[(0.06750496901189897,)]

In [13]:
%%sql
SELECT "Vehicle_Age", "Vehicle_Damage", COUNT(*) AS count
FROM carinsuranceclaim
GROUP BY "Vehicle_Age", "Vehicle_Damage";

 * postgresql://postgres:***@localhost:5432/food_ordering_system
6 rows affected.

[('< 1 Year', 'No', 116590),
 ('< 1 Year', 'Yes', 48196),
 ('> 2 Years', 'No', 15),
 ('> 2 Years', 'Yes', 15992),
 ('1-2 Year', 'No', 72091),
 ('1-2 Year', 'Yes', 128225)]

In [14]:
%%sql
SELECT "Gender", AVG("Annual_Premium") AS average_premium, 
       MIN("Annual_Premium") AS min_premium,
       MAX("Annual_Premium") AS max_premium
FROM carinsuranceclaim
GROUP BY "Gender";

 * postgresql://postgres:***@localhost:5432/food_ordering_system
2 rows affected.

[('Female', 30495.96817452019, 2630.0, 540165.0),
 ('Male', 30622.655247374856, 2630.0, 540165.0)]

In [17]:
%%sql
SELECT
    "Previously_Insured",
    COUNT(*) AS total_count,
    SUM("Response") AS response_count,
    100.0 * SUM("Response") / COUNT(*) AS response_rate
FROM carinsuranceclaim
GROUP BY "Previously_Insured";

 * postgresql://postgres:***@localhost:5432/food_ordering_system
2 rows affected.

[(0, 206481, Decimal('46552'), Decimal('22.5454158009695807')),
 (1, 174628, Decimal('158'), Decimal('0.09047804475799986256'))]

In [40]:
%%sql

SELECT CORR("Age"::numeric, ("Vehicle_Damage"::numeric)::integer) AS correlation_coefficient
FROM carinsuranceclaim
WHERE "Vehicle_Damage" ~ '^\d+(\.\d+)?$';

 * postgresql://postgres:***@localhost:5432/food_ordering_system
1 rows affected.

[(None,)]

In [22]:
%%sql
SELECT "Region_Code", AVG("Annual_Premium") AS average_premium 
FROM carinsuranceclaim
GROUP BY "Region_Code" 
limit 5;

 * postgresql://postgres:***@localhost:5432/food_ordering_system
5 rows affected.

[(0, 3047.548738248392),
 (1, 2711.285714285714),
 (2, 26955.2127290738),
 (3, 24523.64097297297),
 (4, 23596.426429761243)]

In [ ]:
%%sql
SELECT "Region_Code", ROUND(AVG("Annual_Premium"), 2) AS average_premium
FROM carinsuranceclaim
GROUP BY "Region_Code"
ORDER BY average_premium DESC
LIMIT 5;

In [63]:
%%sql
SELECT "Region_Code", ROUND(AVG("Annual_Premium"), 2) AS average_premium
FROM carinsuranceclaim
GROUP BY "Region_Code"
ORDER BY 2 DESC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/food_ordering_system
(psycopg2.errors.UndefinedFunction) function round(double precision, integer) does not exist
LINE 1: SELECT "Region_Code", ROUND(AVG("Annual_Premium"), 2) AS ave...
                              ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.

[SQL: SELECT "Region_Code", ROUND(AVG("Annual_Premium"), 2) AS average_premium
FROM carinsuranceclaim
GROUP BY "Region_Code"
ORDER BY 2 DESC
LIMIT 5;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [65]:
%%sql
WITH PremiumStats AS (
    SELECT
        AVG("Annual_Premium") AS mean,
        STDDEV("Annual_Premium") AS stddev
    FROM carinsuranceclaim
)
SELECT
    "Annual_Premium",
    CASE
        WHEN ("Annual_Premium" - ps.mean) / ps.stddev > 3 OR ("Annual_Premium" - ps.mean) / ps.stddev < -3
        THEN 'Outlier'
        ELSE 'Not Outlier'
    END AS outlier_status
FROM carinsuranceclaim ii
CROSS JOIN PremiumStats ps
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/food_ordering_system
5 rows affected.

[(40454.0, 'Not Outlier'),
 (33536.0, 'Not Outlier'),
 (38294.0, 'Not Outlier'),
 (28619.0, 'Not Outlier'),
 (27496.0, 'Not Outlier')]

In [70]:
%%sql
SELECT
  "Driving_License",
  AVG("Annual_Premium") AS mean_premium,
  PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY "Annual_Premium") AS median_premium,
  PERCENTILE_CONT(0.25) WITHIN GROUP (ORDER BY "Annual_Premium") AS q1_premium,
  PERCENTILE_CONT(0.75) WITHIN GROUP (ORDER BY "Annual_Premium") AS q3_premium
FROM
  carinsuranceclaim
GROUP BY
"Driving_License";

 * postgresql://postgres:***@localhost:5432/food_ordering_system
2 rows affected.

[(0, 34999.72783251232, 35767.5, 27091.5, 46024.25),
 (1, 30555.005185529953, 31661.0, 24401.0, 39387.0)]

In [71]:
%%sql
SELECT
  COUNT(*) AS total_count,
  SUM("Previously_Insured") AS previously_insured_count,
  SUM("Previously_Insured") / COUNT(*) AS proportion_previously_insured
FROM
  carinsuranceclaim;

 * postgresql://postgres:***@localhost:5432/food_ordering_system
1 rows affected.

[(381109, Decimal('174628'), Decimal('0.45821011836508715354'))]

In [72]:
%%sql
SELECT
  "Previously_Insured",
  AVG("Age") AS mean_age,
  PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY "Age") AS median_age,
  PERCENTILE_CONT(0.25) WITHIN GROUP (ORDER BY "Age") AS q1_Age,
  PERCENTILE_CONT(0.75) WITHIN GROUP (ORDER BY "Age") AS q3_Age
FROM
  carinsuranceclaim
GROUP BY
  "Previously_Insured";

 * postgresql://postgres:***@localhost:5432/food_ordering_system
2 rows affected.

[(0, Decimal('42.4556399862457078'), 42.0, 29.0, 52.0),
 (1, Decimal('34.5268399111253636'), 27.0, 24.0, 43.0)]

In [ ]:
%%sql
SELECT AVG("Annual_Premium") AS average_premium
FROM carinsuranceclaim
WHERE "Vehicle_Damage" = 1;---------

In [77]:
%%sql
SELECT
  "Vehicle_Age",
  "Previously_Insured",
  COUNT(*) AS total_count,
  SUM("Response") AS positive_responses,
  SUM("Response") * 100.0 / COUNT(*) AS response_rate
FROM
  carinsuranceclaim
GROUP BY
  "Vehicle_Age",
  "Previously_Insured";

 * postgresql://postgres:***@localhost:5432/food_ordering_system
6 rows affected.

[('< 1 Year', 0, 55529, Decimal('7140'), Decimal('12.8581461938806750')),
 ('< 1 Year', 1, 109257, Decimal('62'), Decimal('0.05674693612308593500')),
 ('> 2 Years', 0, 15961, Decimal('4701'), Decimal('29.4530417893615688')),
 ('> 2 Years', 1, 46, Decimal('1'), Decimal('2.1739130434782609')),
 ('1-2 Year', 0, 134991, Decimal('34711'), Decimal('25.7135660895911579')),
 ('1-2 Year', 1, 65325, Decimal('95'), Decimal('0.14542671259089169537'))]

In [83]:
%%sql
SELECT
  CASE
    WHEN "Age" >= 20 AND "Age" < 30 THEN '20-29'
    WHEN "Age" >= 30 AND "Age" < 50 THEN '30-49'
    WHEN "Age" >= 50 THEN '50+'
    ELSE '50 and above'
  END AS age_group,
  AVG("Annual_Premium") AS average_premium
FROM
  carinsuranceclaim
GROUP BY
  age_group
ORDER BY
  age_group;

 * postgresql://postgres:***@localhost:5432/food_ordering_system
3 rows affected.

[('20-29', 30175.02898840206),
 ('30-49', 29517.81246567401),
 ('50+', 32649.338157270187)]

In [84]:
%%sql
SELECT
  "Gender",
  "Vehicle_Damage",
  COUNT(*) AS total_count,
  SUM("Response") AS positive_responses,
  SUM("Response") * 100.0 / COUNT(*) AS response_rate
FROM
  carinsuranceclaim
GROUP BY
  "Gender",
  "Vehicle_Damage";

 * postgresql://postgres:***@localhost:5432/food_ordering_system
4 rows affected.

[('Female', 'No', 95355, Decimal('418'), Decimal('0.43836191075454879136')),
 ('Female', 'Yes', 79665, Decimal('17767'), Decimal('22.3021402121383293')),
 ('Male', 'No', 93341, Decimal('564'), Decimal('0.60423608060766437043')),
 ('Male', 'Yes', 112748, Decimal('27961'), Decimal('24.7995529854188101'))]

In [100]:
%%sql
SELECT
  SUM(CASE WHEN "Vehicle_Damage" = 'Yes' AND "Driving_License" = 1 THEN 1 ELSE 0 END) AS vehicle_damage_with_license,
  SUM(CASE WHEN "Vehicle_Damage" = 'Yes' AND "Driving_License" = 0 THEN 1 ELSE 0 END) AS vehicle_damage_without_license,
  SUM(CASE WHEN "Vehicle_Damage" = 'No' AND "Driving_License" = 1 THEN 1 ELSE 0 END) AS no_vehicle_damage_with_license,
  SUM(CASE WHEN "Vehicle_Damage" = 'No' AND "Driving_License" = 0 THEN 1 ELSE 0 END) AS no_vehicle_damage_without_license
FROM
  carinsuranceclaim;

 * postgresql://postgres:***@localhost:5432/food_ordering_system
1 rows affected.

[(191857, 556, 188440, 256)]